function para(week,nowdata,numberpara)
{
	var para = [ [ [ "пр.Иностранный язык" , "лек.Физическая культура"],
	               [ "пр.Начертательная геометрия" , "пр.Основы геодезии", "лек.Основы геодезии"],
	               [ "пр.Философия" , "пр.Физра"] ,
	               [ "пр.Менеджмент" , "лек.Философия"],
	               [ "пр.Математика" , "лек.Физическая культура", "лек.Начертательная геометрия"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "пр.Нетяговый подвижной состав", "пр.Основы геодезии", "лек.Нетяговый подвижной состав"],
	               [ "лаб.Физика" , "пр.Иностранный язык"],
	               [ "пр.Философия" , "пр.Физика"] ,
	               [ "лек.Математика" , "пр.Математика"],
	               [ "лек.Менеджмент" , "лек.Физическая культура", "лек.Физика"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function paratime(week,nowdata,numberpara)
{
	var para = [ [ [ "4" , "5"],
	               [ "1" , "2", "3"],
	               [ "1" , "2"] ,
	               [ "4" , "5"],
	               [ "3" , "4", "5"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "2" , "3" , "4"],
	               [ "3" , "4"],
	               [ "4" , "5"] ,
	               [ "4" , "5"],
	               [ "3" , "4", "5"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function auditorium(week,nowdata,numberpara)
{
	var para = [ [ [ "5214-1410" , "5301"],
	               [ "Л53" , "7105", "Л37"],
	               [ "5408" , "5сп/з 5"] ,
	               [ "5408" , "5301"],
	               [ "5205" , "5308", "5301"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "8207" , "7105" ,"Л37"],
	               [ "330(6)-(3)" , "5214-1408"],
	               [ "1413" , "3306"] ,
	               [ "5205" , "5205"],
	               [ "5402" , "5409", "5301"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function alllessons(week,day)
{
	var para = [[2, 3, 2, 2, 3, 0, 0 ], 
	           [3, 2, 2, 2, 3, 0, 0 ]]
	return para[week][day];
}