function para(week,nowdata,numberpara)
{
	var para = [ [ [ "пр.Менеджмент" , "лек.Физическая культура"],
	               [ "пр.Основы геодезии" , "пр.Нетяговый подвижной состав", "лек.Основы геодезии"],
	               [ "пр.Элективные курсы по физре" , "пр.Математика", "лаб.Физика"] ,
	               [ "пр.Философия" , "лек.Философия"],
	               [ "пр.Иностранный язык" , "лек.Физическая культура", "лек.Начертательная геометрия"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "пр.Философия" , "лек.Нетяговый подвижной состав"],
	               [ "пр.Начертательная геометрия" , "пр.Основы геодезии"],
	               [ "пр.Математика" , "пр.Иностранный язык"] ,
	               [ "лек.Математика" , "пр.Физика"],
	               [ "лек.Менеджмент" , "лек.Физическая культура", "лек.Физика"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function paratime(week,nowdata,numberpara)
{
	var para = [ [ [ "4" , "5"],
	               [ "1" , "2", "3"],
	               [ "2" , "3", "4"] ,
	               [ "4" , "5"],
	               [ "3" , "4", "5"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "3" , "4"],
	               [ "4" , "5"],
	               [ "3" , "4"] ,
	               [ "4" , "5"],
	               [ "3" , "4", "5"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function auditorium(week,nowdata,numberpara)
{
	var para = [ [ [ "5408" , "5301"],
	               [ "7105" , "8306", "Л37"],
	               [ "5сп/з 5" , "5205", "330(6)-(1)"] ,
	               [ "5409" , "5301"],
	               [ "140(8)-(6)" , "5308", "5301"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "Л66" , "Л37"],
	               [ "Л52" , "7105"],
	               [ "5205" , "5406-1408"] ,
	               [ "5205" , "3309"],
	               [ "5402" , "5409", "5301"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function alllessons(week,day)
{
	var para = [[2, 3, 3, 2, 3, 0, 0 ], 
	           [2, 2, 2, 2, 3, 0, 0 ]]
	return para[week][day];
}