function para(week,nowdata,numberpara)
{
	var para = [ [ [ "л.Элективные курсы по физической культуре и спорту." , "л.Инженерная экология", "л.Тяга поездов"],
	               [ "пр.Организация доступной среды на транспорте" , "пр.Иностранный язык", "фв. Элективные курсы по физической культуре и спорту"],
	               [ "пр.Тяга поездов" , "лаб.Безопасность жизнедеятельности", "лаб.Грузоведение"] ,
	               [ "л.Организация доступной среды на транспорте" , "л.Безопасность жизнедеятельности"],
	               [ "фв.Элективные курсы по физической культуре и спорту" , "пр.Инженерная экология", "пр.Автоматика, телемеханика и связь на железнодорожном транспорте"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "пр.Философия" , "лек.Нетяговый подвижной состав"],
	               [ "пр.Начертательная геометрия" , "пр.Основы геодезии"],
	               [ "пр.Математика" , "пр.Иностранный язык"] ,
	               [ "лек.Математика" , "пр.Физика"],
	               [ "лек.Менеджмент" , "лек.Физическая культура", "лек.Физика"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function paratime(week,nowdata,numberpara)
{
	var para = [ [ [ "1" , "2", "3"],
	               [ "1" , "2", "4"],
	               [ "2" , "3", "4"] ,
	               [ "1" , "2"],
	               [ "1" , "2", "3"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "3" , "4"],
	               [ "4" , "5"],
	               [ "3" , "4"] ,
	               [ "4" , "5"],
	               [ "3" , "4", "5"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function auditorium(week,nowdata,numberpara)
{
	var para = [ [ [ "ЭИОС" , "ЭИОС", "ЭИОС"],
	               [ "9408" , "9101", "5с/з"],
	               [ "7208" , "Л41/", "Л66"] ,
	               [ "ЭИОС" , "ЭИОС"],
	               [ "С/П" , "5304", "1201"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ], 
	             [ [ "Л66" , "Л37"],
	               [ "Л52" , "7105"],
	               [ "5205" , "5406-1408"] ,
	               [ "5205" , "3309"],
	               [ "5402" , "5409", "5301"],
	               [ "Нет пар"],
	               [ "Нет пар"] 
	             ]
	            ]
    return para[week][nowdata][numberpara];
}
function alllessons(week,day)
{
	var para = [[2, 3, 3, 2, 3, 0, 0 ], 
	           [2, 2, 2, 2, 3, 0, 0 ]]
	return para[week][day];
}